"""
Двуграмма — это упорядоченная пара (то есть строка длины два) прописных букв латинского алфавита.
Например, «AZ», «AA», «ZA» — три различные двуграммы.
Вам задана строка s, состоящая из n прописных букв латинского алфавита.
Ваша задача вывести любую двуграмму, которая содержится в этой строке как подстрока
(то есть как два последовательных символа строки)
максимальное количество раз. Например, для строки s = «BBAABBBA» ответ — это двуграмма BB,
которая встречается в s три раза.
Заметьте, что вхождения двуграммы могут пересекаться друг с другом.

Входные данные
Первая строка входных данных содержит целое число n (2≤n≤100) — длину строки s.
Вторая строка входных данных содержит строку s, состоящую из n прописных букв латинского алфавита.

Выходные данные
Выведите одну строку, состоящую ровно из двух прописных букв латинского алфавита — любую двуграмму,
которая содержится в заданной строке s как подстрока (то есть два последовательных символа строки) максимальное количество раз.
"""

n = int(input())
s = input()

m = [s[i:i+2] for i in range(n-1)]
print(max(m, key=m.count))